ekhpascal/HillGrov/master/sdkconfig.defaults.esp32p4
CONFIG_IDF_TARGET="esp32p4"

# Early P4 silicon (rev v1.3). IDF 6.0.1 defaults to rev v3.1 and the families
# are mutually exclusive: without these, esptool refuses the flash with
# "requires chip revision in range [v3.1 - v3.99] (this chip is revision v1.3)".
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# 32 MB on the board; the stock default declares 2 MB and the bootloader clamps.
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# The partition table sits at 0xF000, NOT IDF's P4 default of 0x8000. The custom
# bootloader is 0x60f0 bytes and 0x8000 leaves only 0x6000 above the bootloader
# at 0x2000, which fails a post-link size assertion by 240 bytes. 0xF000 gives
# the same 0xD000 window the ESP32 has, using dead space below nvs at 0x10000.
CONFIG_PARTITION_TABLE_OFFSET=0xF000
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_p4.csv"

# The MIPI-DSI frame buffer and LVGL need PSRAM (ESP32-P4NRW32, in package).
# Harmless here and required by the panel plan that follows.
CONFIG_SPIRAM=y
